app/controllers/order_items_controller.rb

INSERT INTO "order_items" ("quantity", "order_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 2], ["order_id", 1], ["product_id", 1], ["created_at", "2020-02-19 12:31:06.043793"], ["updated_at", "2020-02-19 12:31:06.043793"]]
---
  def create
    @order_item = OrderItem.new(order_items_params)

    if @order_item.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_order
    @order = Order.find(params[:order_id])