app/controllers/orders_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT "products".* FROM "products"
---
  def show
    @order_item = @order.order_items.build
    @products = Product.all

INSERT INTO "orders" ("warehouse_id", "customer_name", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["warehouse_id", 5], ["customer_name", "Marc Dagatan"], ["uuid", "735537bf-51ea-46c2-90eb-712c66ba135d"], ["created_at", "2020-02-19 12:10:49.007208"], ["updated_at", "2020-02-19 12:10:49.007208"]]
---
  def create
    @order = Order.new(order_params)

    if @order.save