app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("sku", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sku", "HUA-001"], ["name", "Huawei"], ["created_at", "2020-02-15 08:53:54.945228"], ["updated_at", "2020-02-15 08:53:54.945228"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "sku" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Sony"], ["sku", "SNY-65-LED"], ["updated_at", "2020-02-15 08:53:44.934544"], ["id", 1]]