app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
  def index
    @stocks = Stock.all