app/controllers/warehouses_controller.rb

  def create
    @warehouse = Warehouse.new(warehouse_params)

    if @warehouse.save
---
INSERT INTO "warehouses" ("street", "city", "province", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["street", "Uhhh"], ["city", "123"], ["province", ":D"], ["created_at", "2020-02-19 11:39:30.305989"], ["updated_at", "2020-02-19 11:39:30.305989"]]

  def destroy
    @warehouse.destroy!
---
DELETE FROM "warehouses" WHERE "warehouses"."id" = ?  [["id", 1]]